{"rating": 4, "user": "Keiko Tokita", "review": "Great service. I can not really say food is phenomenal but good vegetarian options.", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "shravani sharma ramesh", "review": "Very good service.It was last minute, still took efforts to provide food by calling back. Very good customer service. Finally got some food for parents at the last time in NewYork.Good vegetarian options with lot of dipping options for rice pancake (idly)", "business": "Saravanaa Bhavan"}
{"rating": 3, "user": "Rajarshi Choudhury", "review": "Came to the 27th street branch. Extremely pathetic service. The reataurant is empty  yet they have been unable to assign us seats for the last 20 minutes. Lets see where it lands. Hopefully we will get a seating here in the next hour. ", "business": "Saravanaa Bhavan"}
{"rating": 1, "user": "Philip Baker", "review": "I thought I would get the same quality of food I had since I last visited a  couple of years back but they failed me badly; quality is not even up to the standard. And it is WAY TOO EXPENSIVE. You really want to taste south indian dishes ", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Samarth Hiremath", "review": "You need to try this place if you love dosa. They have a variety of dosas. The dosas were crispy and delicious.", "business": "Saravanaa Bhavan"}
{"rating": 2, "user": "Monir Mirdha", "review": "Ordered for pickup, no utensils or napkins were provided. Also I got stomach cramps after. My wife liked the Idli, so 2 star.", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Tegan Fleming", "review": "\"Food is good, friendly staff and nice service with less delay.\"\"It is an expensive place and offers variety of indian dishes.\"\"They also serve all you can eat meals and combo meals, which are filling.\"", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Aartee Potnis", "review": "Very well socially distanced restaurant. Very clean and regular notes for contact tracings and temperature checks.Breakfast was really yummy and the special South Indian coffee was so good!First time here but certainly not the last!!", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Shyam Babu Upadhyay", "review": "Very tasty and Authentic (which is rare) South Indian food here.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Rajesh Kumar", "review": "I love the food as a south Indian , i feel like i am home about my experience i was serviced By Shweta short hair girl she is exceptionally good at giving a good service with the tasty food i would love to recommend this place ", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Karthikeyan Rajaram", "review": "The ongoing pandemic has definitely taken a toll on a lot of businesses and public places since a consumers mindset to buy anything outside of essentials or to visit a public place like a park or beach, has crippled down significantly. Now ", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Santosh Ragi", "review": "Tasty food & friendly staff. Definitely recommend a visit.", "business": "Saravanaa Bhavan"}
{"rating": 1, "user": "Mohamed Salim", "review": "Worst experience, posting this comment right after the dinner. They served with spoiled potato gravy for parotta and found steel scrubber in sambar vada. Though they compensated with discount but bad experience is bad. I wont visit this place again", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "H Gala", "review": "Update on 3/13/2021: Saravanaa Bhavan has been a family favorite for many years. Post-COVID, we went today after many months. Pleased to see tables were spaced out. Food is still good, perhaps not as good as I remember it. But prices have gone up significantly!", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Prem Sadasivananda", "review": "An amazing place with great food and staff.Try out a dosa or a South Indian tali and you will want to come every day!Please give it a try!", "business": "Saravanaa Bhavan"}
{"rating": 1, "user": "Pranit S Puri", "review": "What an wasted effort. Nothing like it's India counterparts. The quality was bad abd the food served semi warm. Stay away!!", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Neelam Sethi", "review": "Awesome south indian food with lots of varieties with authentic taste", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Tayna Pinto", "review": "Food was delicious and service was amazing. Had a wonderful brunch! Outdoor seating is also appropriately spaced out, much better than many other places I've seen since covid started", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Kathryn Cervantes", "review": "Casual and authentic South Indian restaurant. Famous chain that started in India with locations around the world. All vegetarian and full of flavor. Went with someone more familiar with the cuisine which was very helpful.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Asha", "review": "Awesome service. Delicious and authentic South Indian food. Clean and safe location .", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Jesse Lewis", "review": "Brought my BF here for his b-day dinner. He loves steak and lobster!  Me, not so much a meat lover, i ended up with the chicken which was excellent! It was juicy and tender. Could not complain.My bf loved his food as well. The lobster was ", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Deyon Singh", "review": "Food was amazing and the waiter made sure we had all things we needed.  Also when we left he packed the bag and made sure we had all the chutney. will go again.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Elizabeth Schofield", "review": "Finally got some food for parents at the last time in NewYork.Good vegetarian options with lot of dipping options for rice pancake (idly)", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "candace Pelletier", "review": "Food was delicious and service was amazing. Had a wonderful brunch! Outdoor seating is also appropriately spaced out, much better than many other places I've seen since covid started", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Nitin Malla", "review": "Delicious! I love the assortment of curries/sauces they serve. This place is high quality and an authentic Chennai India experience. I don't understand why it is not rated a lot higher.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Ayan Chatterjee", "review": "Great quantity. Great price.", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "rahul gadi", "review": "I love the food here. But due to outdoor sitting, it is very windy sometimes. Hope they keep some barriers to decrease wind.Also food tastes best only when it is hot here. So you got to eat quick.", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Gary Benowitz", "review": "I really love this place.  I've been coming for many years.  The Dosas are great.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Veena Advani", "review": "Food was delicious and service was amazing. Had a wonderful brunch! Outdoor seating is also appropriately spaced out, much better than many other places I've seen since covid started", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Ronnie Borden", "review": "Spicy but delicious authentic food and I mean SPICY. WoW", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Supreeth Shankarghal", "review": "Great place for South Indian food. Great value. The last orders for food is 9:30 pm, although closing is 10 pm. Highly recommended for South Indian foodies.", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Rajamanickam Ravisekar", "review": "It's a south indian restaurant. Nice taste. We tried parotta (by default it was Wheat), Ghee and paper roast. It was same taste as like in their Chennai branch", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Elizabeth Turnbull", "review": "Extremely good food and great service very knowledgeable.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Ujj Nath", "review": "Really awesome food. I especially like their rawa masala dosa and their onion and peas Uttapam", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "saroj lenka", "review": "One liner, good authentic south indian food.I always prefer dosa, wada, idli uthapam kind of food when I eat vegetarian. Here is the place in NYC to have that kind. Most of the taste are good, especially Sambar is awesome with idli, Poor, ", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "D Mc Kenzie", "review": "This place advertises as a vegetarian restaurant but there's one or two vegan items, but you have to be careful because even though you give the order for vegan, cow butter (ghee) might still be included in some of the dishes.all jokes ", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Gurleen K", "review": "Great place to get Dosa's and other South Indian cuisine. Dosa is a thin crepe make of ground rice and it can be filled with spiced potatoes and you get that with lots of chutneys and sambar. This is a vegetarian restaurant and you can get ", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "technostar marine", "review": "A good place in crowded Manhattan for a simple South Indian food.Food is tasty and clean.", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "akshay talegaonkar", "review": "Good place to eat authentic south Indian food in NYC. Have been here multiple times and its been good experience so far. This time we had Mysore masala dosa, cheese masala dosa, dahi vada and filter coffee. Everything was definitely a bit ", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Aditya Ponkshe", "review": "One of thest places in the city to have South Indian food.Food quality is great! Service is okay.", "business": "Saravanaa Bhavan"}
{"rating": 1, "user": "Baisakhi Mukherjee", "review": "horrible horrible experience! this used to be  favorite place of mine. two weeks ago placed an order though a food delivery app. order was not ready on time, had to wait over 30 mins outside for pickup even after the app confirmed order was ", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Dennis Denev", "review": "Dosas and thalis and just good Indian cooking altogether . This is our go to place when in the hood , we love it .  The food is authentic as it gets and it is freshly made. The dosas are the signature dish here , try them!", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Vivekanandan Thanigaivel", "review": "They are the best for their pure veg South Indian food. 1 star less for the little hard parota but it was tasty ", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Shraddha Vyas", "review": "DEFINITELY WORTH IT!!Anup served us with full Covid rules & home like service , food was fresh & delicious ! Very recommended. Drove all the way from Jersey city to Edison to have South Indian meal. Kudos to Anup for recommending the best food. :)", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Vikas Shrivastava", "review": "I have had mixed experience here, bissibeda bhat is average, but dosas, idlis and chatnies are good.Edit: after lots of more trips I can say that chapati is really really good thali is good too.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Kathryn Hoffberg", "review": "Great, authentic southern Indian vegetarian food. Spicy enough so that you feel it but can still taste your food!", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Bhagya Baburaj", "review": "Ghee roast masala dosa for the winnn", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Lenny Li", "review": "This was my first time eating southern Indian style food, and it was a fun experience eating with your hands. My vegetarian friends really liked this place but all of the dishes would have been better with meat. The dishes with potatoes in them were the best!", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Chandra M", "review": "Delicious Veg tiffin. Meals are a hit or miss. Service was good . Definitely better than Adyar Ananda Bhavan in taste and service.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Pranay Banerjee", "review": "Had medu wada and Mysore masala dosa.. One can literally taste the freshness.. the sambar and chutneys provided on the side speak for themselves.. Delicious..!! Oh, and all of this is purely vegetarian. If a non vegetarian like me can write so much about this place, you get the idea, right ? Must visit..", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Sonam Tshering", "review": "Loved the madras coffee. It was really a cute presentation with a new experience for my coffee adventure. Channa Baturra was awesome. The poori bread was huge and less oiled. Do not forget to squeeze the lime over the channa and to add some ", "business": "Saravanaa Bhavan"}
{"rating": 1, "user": "Alexandra North", "review": "Got my order wrong. Nuff said.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "The Corporate Diwali Manisha Beriwala", "review": "Anup served us with full Covid rules & home like service , food was fresh & delicious ! Very recommended .", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Mohit Gupta", "review": "Great food, good service. Would recommend it to anyone who wants to try Indian food for the first time. Brace yourself for the spices though.Also, end your meal with a filter coffee.", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Ben Eustace", "review": "Delicious and authentic South Indian vegetarian food. A wide range of  breads, doughs and pastries serves with a variety of flavoured sauces. Great Indian comfort food! Also highly recommend trying the traditional Indian filter coffee - served with a bowl and a cup so you can pour it to cool it down.", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "costinela costi", "review": "A lot of fried carbs lol . If you guys want some veggie protein will have to have it spicy even if you don't eat spicy", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Gigi Hall", "review": "Delicious and authentic dosas, idlis, vadas, sambhar and chutneys.", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Kandasamy Ramanathan", "review": "Somehow missing the authentic taste of Chennai Saravana Bhavan, but come on.. at least you get to taste Saravana Bhavan food in the heart of big apple. Not so big in spaces and always you feel congested as this place is packed most of the time with customers.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Aakarsh Rajagopalan", "review": "Great south  Indian food", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Ankit Sanghi", "review": "It's Saravana Bhavan. It can't not be good. The dosa reminded me of home.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Malavika Muralidharan", "review": "The idly/dosas are the best here! Excellent combo platters available - the South India Thali and the Mini Tiffin are some great options. I've tried pretty much everything South Indian on their menu and it's all very good! Always love coming here for some awesome comfort food.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Ram Viswanathan", "review": "Good food served fast in a minimalistic setting.  The place was almost empty when we went early evening, but filled quickly before we finished.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Raoul Kamath", "review": "Wow - very pleasantly surprised by the overall experience here. Well lit, clean, comfortable seating, friendly staff, good food - actually very good food!", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Senor Wenses", "review": "Good value money-wise with authentic taste.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Leon Morales", "review": "Last week was our first time we visited this magnificent restaurant. But It is no doubt not the last time. We had great time with the generous service, with the magnificent  dishes and fine drinks and with the comfortable pay. We will definitely return there again.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "SANJEEV JAIN", "review": "Our favorite south Indian restaurant. This is at Lexington Avenue. If I'm not wrong there are over 25 Indian restaurants around Lexington. Nice and well maintained Sarvana Bhawan. We had dias idli and vada. Sambhar is too good. All Saravana bhavan south Indian tastes same across the world internationally. 3 pax around $52.", "business": "Saravanaa Bhavan"}
{"rating": 3, "user": "Thiyagarajan Sridharan", "review": "Giving it 3 coz of the soaky mysore masala dosai & bad bad idly!! Pongal & vada was amzing though", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Ivan Rikhmaier", "review": "I like the place and will visit again", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "James LaVela", "review": "A classic vegetarian Indian restaurant where even the coffee is beautiful.", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Saranya Venkatesan", "review": "Saravana bhavan in nyc is tasty south Asian food ... good variety of dosa on Saturday n Sunday items", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Manoj Pansare", "review": "Awesome food, quick service.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "R. Priya Clark", "review": "This food was excellent. Sooo tasty. It is a little crowded since the place is small. But the waiting staff provides great service, and will get you seated as soon as possible. Best Dosas ever! The coffee was very tasty also.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Sandra Roshan", "review": "Excellent customer service great spot to eat proper South Indian food!!!", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Garrett Simpson", "review": "So yummy, authentic, good portion size", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Anthony Giudice", "review": "Just so effin good.  Dosa masters.", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Popuri Yashwanth", "review": "Vegetarian Indian food. Mini meals , masala dosa were good than Their own branch in Irving, Texas.", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Caesar C.", "review": "Delicious food and very friendly waitstaff. We dined outside due to COVID and were very pleased they could accommodate, unlike other Indian restaurants in the area.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Rich Chaudhary", "review": "Probably the best South Indian food that you will get in the city", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Rishi Tejura", "review": "Best Dosa in Murray Hill!", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "shiva chetan", "review": "Excellent food! Onion rava masala dosa is a must have :)", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Panchabakesan Thiagarajan", "review": "Mouth watering south Indian food in NY downtown... a must stop if you are visiting this place..", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Donald Christensen", "review": "This is the real deal. Came here just after traveling through India for three months. The food is accurately prepared and the surroundings are very clean. Very authentic and reasonably priced.", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Shyam Senthil Nathan", "review": "If it were not for the exceedingly long wait times that we had to endure outside the pace, since there is almost no place for waiting inside, and for the prices being on the higher sides. I will give this one a perfect 5. Tastes are too good to be true.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Arbel Vigodny", "review": "Very much enjoyed the lunch special! The thali was  great with a variety of tasty dishes. This would be a great place for a vegetarian diner.", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Bibil Krishna", "review": "NYC Saravana bhavan serves delicious south Indian food with variety food options.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Sam R", "review": "Omg thali & mysore dosa is THAT good! Go...now... seriously.", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "R U", "review": "Thanks to Saravana Bhavan helped me to get to taste South Indian dishes in US. Prices were high, taste was ok. Its just next to Times Square.", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Amey Paranjape", "review": "Decent south indian meal, I would not say excellent though. Sambar was not authentic south indian sambar. Other than that, paper masala dosa, onion chilli rawa masala dosa and onion chilli uttapam. Uttapam and paper dosa were decent. Rawa ", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "reitika singh", "review": "Excellent service with awesome taste", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Heena Ahmed", "review": "As an Indian, I highly recommend this place. They dont mess with authentic Indian taste for anybody! Its great value for money. South Indian food does not get better than this!!! ", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Rajesh Parekh", "review": "Delicious South Indian food in New York City. We liked both the Uttapam and the South Indian Thali we ordered. I recommend this place highly.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Pooja Kunder", "review": "Good authentic south Indian food", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Thulasi Kashyap", "review": "Home away from home experience for any South Indian! Traditional food that tastes great and fills your stomach to the max. Quick service and nice atmosphere. Unlike most Indian restaurants this doesnt close in the afternoons but make it in before 3pm for the lunch specials. May I suggest the South Indian Thali.", "business": "Saravanaa Bhavan"}
{"rating": 2, "user": "B P", "review": "Must admit that, during our visit to Saravana Bhavan - as we enter there are 15-20 people standing literally on the front door to the street.  There is not even a single staff member around to make the booking on the table to confirm the ", "business": "Saravanaa Bhavan"}
{"rating": 3, "user": "abhinav raku", "review": "Good service, ok ok food", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Nagaraj Naik", "review": "Great food, served hot and fresh. Hygienic ambience. I wish they had under $10 take away lunch option. Food is a bit too much for work lunch", "business": "Saravanaa Bhavan"}
{"rating": 3, "user": "Alpine S", "review": "Good..but not like before.", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Suchitra Kamath", "review": "It is a clean place for vegetarian fare with good food and portions. I found the interaction with the staff very disinterested.", "business": "Saravanaa Bhavan"}
{"rating": 1, "user": "Sanket Gupta", "review": "Prices in menu are different from what they charge. I have been to Chennai garden across the street and they don't do that.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Vikas Shastrula", "review": "If you are looking for some pure vegetarian Indian food in Manhattan, Newyork..Then this is the BEST place you have to go. Awesome Food... The taste will make you remember your mother country..mother hand made taste... Love for the food....", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "George Fine", "review": "Great dosas, the weekday lunch special tiffin lunch is excellent, small variety of flavors; I have read lots of reviews on the service of this joint and its true ... they are not the friendlies bunch ... but we love their food ...", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "alok rao", "review": "Food was delicious as expected and staffs were very good", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "France Roy", "review": "Love the lunch special.", "business": "Saravanaa Bhavan"}
{"rating": 3, "user": "Yavor Geshev", "review": "Nice Indian restaurant. Food was prepared fast. Asked the waiter to give us separate checks before we ordered, sure enough he didnt and then we had to split up charges for 4 people multiple times because he messed up the credit cards.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Praveena Pramod", "review": "Yummy. And good service", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "will barker", "review": "Wow! Really great dosa here.  Very satisfying and best I can recall outside of India!", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Sathya Narayanan", "review": "No disappointments on the food! Walked 30 mins to enjoy this home food!", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Chani Lerner", "review": "I really enjoyed it!!!", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Monalisa Padhee", "review": "Authentic South Indian food, only downside was the Gulab jamun", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Soorya Deepak", "review": "Great taste", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Sourabh Rakhunde", "review": "One of the place to eat south Indian food in NY. Variety of Dosa and Uttapas. They serve thalis as well which is really heavy. Must visit restaurant with family for authentic south Indian taste.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Jidesh", "review": "Awesome quality of food compared to other locations. Love the food. It's crowded but is clean and good service.", "business": "Saravanaa Bhavan"}
{"rating": 3, "user": "Clara Cambon-Thiebaud", "review": "I used to enjoy this place but the waitress is rude. Sometimes her brash behavior amuses us with my husband, but today I've decided I have had enough. I was having lunch alone and she walked up to me and asked me to leave because she was ", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Dinesh's Flavours", "review": "Every time I miss home food I love to go to Saravanaa Bhavan. This is one of the best south Indian restaurants. There taste across the globe is amazing.Highly suggest this place.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Dhanashree Bole", "review": "Great food as always!Taste is consistent throughout all branches", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Pranav Khakhar", "review": "Authentic South Indian food chain having outlets worldwide. Mini meal for breakfast is awesome. 100% Vegeterian food. Love it.", "business": "Saravanaa Bhavan"}
{"rating": 3, "user": "Amit Dey", "review": "Good Dosas. Bad coffee. Charged 15% gratuity for a party of 4 even though the restaurant was empty.", "business": "Saravanaa Bhavan"}
{"rating": 3, "user": "Bhupendra Mahawar", "review": "I only come here for the Chole Bature because they are awesome!", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Varahabhatla Sushmitha", "review": "Located among various Indian restaurants in New York saravaana Bhavan defiy stands apart for it's South Indian menu.We we're here at an odd time of 3.30pm and this was the only place serving food.Though the options were limited we were ", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Rashmi Shantharam", "review": "Pretty good, over-priced Indian food.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Kamiel Gulikers", "review": "For an half hour I was back in Southern India, great massala dosa!", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Alison LeBrun", "review": "Best dosa in NYC", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Madusha Warusavithana", "review": "Delicious Indian vegetarian food. Very good customer service by Vijay. Definitely will be here again", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Tashi Gyaltsen", "review": "Lunch special on weekday is really good. Lots of variety and very reasonable price.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Sushma Akoju", "review": "Idlis and dosas are my favorite here! Fine crispy dosas with 3 different chutneys, delicious potato masala makes me want to visit New York all over again. I just wish they serve dairy free filter coffee.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "coRAZón Light Life", "review": "I really enjoy this special place.  I came looking for delicious dosas, and found a warm cozy environment, excellent service, and great prices (except the beer is a bit pricey).  For a vegan option, ask for the potato dosa.  Again, very welcoming vibe. I feel relaxed as If I am in a friends house as soon as I walk in.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "RAHUL PATIL", "review": "Excellent South Indian style preparations! I always make sure I visit this place whenever I visit New York City.", "business": "Saravanaa Bhavan"}
{"rating": 1, "user": "Jaganath B", "review": "Poor quality of foodPoor management skills", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "sushumna rao", "review": "Highly recommend for tasty South Indian food.", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Sabarinath Venugopalan", "review": "Went with Swedish and Indian friends to showcase South Indian food.  Clean place, fast service and good food.  Big portions.  Good coffee.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Nisha Panicker", "review": "Hands down the best, most authentic Indian food in the US. If you want to taste real Indian cuisine, you need to go here!", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "priyanka pria", "review": "Good service great food", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Bhavna Sogani", "review": "Best South Indian in nyc! Authentic flavors. Service decent, turn over high.", "business": "Saravanaa Bhavan"}
{"rating": 3, "user": "Taohid Latif", "review": "I heard about this South Indian chain from my friends who hail from Chennai and the very idea of a global chain for dosas and idlis intrigued me quite a bit. However, after trying it out, I feel it is not anything special compared to the ", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "avi gupta", "review": "Amazing service and we love the food here. Vijay is very helpful and always knows how to take care if the customers.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Chris Gulden", "review": "Great food and great service. I would definitely go back.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Abhinav Ananthula", "review": "Best Indian food in city.. should definitely try their dosas..I traveled many places coast to coast and ate at multiple Indian restaurants including other branches of Saravanaa Bhavan. For South Indian food this restaurant in New York is ", "business": "Saravanaa Bhavan"}
{"rating": 2, "user": "Pritesh Patel", "review": "Food doesnt taste like Indian food. Total waste of money. Great customer services and supportive staff.", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Kristy Bora", "review": "This is my to-go hangover curing brunch spot and more like to-go weekend hunger curing place.haha. I love that its a 10 min walk from my place and I also love the dosas here. Their filter coffee is good too. The prices are at par with NY ", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Raghuram Somanchi", "review": "The Food  is very tasty... We had great South Indian cuisine.. ... But, the hotel is very small and congested... It's pathetic... We had to stand in queue like beggars... That's the only discomfort I had come across... Barring that everything was fine including polite service... ", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Suraj Janampally", "review": "Had stomach full of yummy food. Place is well maintained .. all authentic vegetarian food..", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Nandini Agarwal", "review": "The best place to go if you are craving for South Indian food. It is usually busy here so be patient to wait for 5-10 min to be seated. I am taking 1 star off from the rating because when I checked with the server if I can get a refill for ", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Dr. Phanindra Gollapalli", "review": "This place is very good for South Indian Vegetarian food, with multiple choice from the menu. Felt a bit expensive when compared with the other Saravana Bhavan hotels.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Peter Ng K.C.", "review": "I like the food here! The picture I posted here is Masala Dosai. Eating food here is as if bringing me back to my home country's mamak stall!", "business": "Saravanaa Bhavan"}
{"rating": 4, "user": "Jansie Ramanathan", "review": "Mini Tiffin was tasty and good quality.Filter coffee was too good.Sambar tasted very good but coconut chutney was not that fresh", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Amolraje Chavan", "review": "An South-Indian Eatery, great food slow service which is explainable cause it's super duper busy but the food coming on table just makes you forget the rest.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Navya Ghanta", "review": "Food was amazing at this place, staff (vijay) was friendly too. Being here felt like home", "business": "Saravanaa Bhavan"}
{"rating": 2, "user": "Ruhail Dawoodani", "review": "Not worth the price... eaten much better South Indian food.. staff is nice... but food sucks", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Suresh Narute", "review": "I heard lot of good things about the restaurant so visited today! It was worth visiting. Very delicious food.", "business": "Saravanaa Bhavan"}
{"rating": 5, "user": "Rajeevalochan Theerthala", "review": "Food quality is good.  But please note THE BILL CONSISTS OF 15% GRATUITY.  In CC receipt, again you can find TIP column.  I simply added 10% TIP and put my signature.  Means, I ended up paying 25% towards TIP.  I strongly feel this is not a ", "business": "Saravanaa Bhavan"}
